app/news/app/views/shared/_discussions.html.erb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? ORDER BY "users"."id" ASC LIMIT ?  [["username", "Kevin07"], ["LIMIT", 1]]
---
              <%# Showing the username of the user who created the discussion %>
              by <%= link_to discussion.user.username, User.where(username: discussion.user.username).first %>

SELECT COUNT(*) FROM "replies" WHERE "replies"."discussion_id" = ?  [["discussion_id", 7]]
---
          </p>
          <p><em><small>Replies: <%= discussion.replies.count %>