app/views/discussions/_form.html.erb

      <span class="select">
        <%= f.input_field :topic_id,  collection:@topics.map { |c| [c.topic, c.id] }, prompt: "Select topic" %>
---
SELECT "topics".* FROM "topics" ORDER BY created_at desc