app/views/discussions/_sidebar.html.erb

      <tr>
        <% Array(User.all.order('last_seen_at desc')[0..3]).each do |d| %>
---
SELECT "users".* FROM "users" ORDER BY last_seen_at desc

      <tr>
        <% Array(User.all.order('last_seen_at desc')[0..3]).each do |d| %>
---
SELECT "users".* FROM "users" ORDER BY last_seen_at desc

      <tr>
        <% Array(User.all.order('last_seen_at desc')[4..7]).each do |d| %>
---
SELECT "users".* FROM "users" ORDER BY last_seen_at desc

      <tr>
        <% Array(User.all.order('last_seen_at desc')[4..7]).each do |d| %>
---
SELECT "users".* FROM "users" ORDER BY last_seen_at desc

      <tr>
        <% Array(User.all.order('last_seen_at desc')[8..11]).each do |d| %>
---
SELECT "users".* FROM "users" ORDER BY last_seen_at desc

      <tr>
        <% Array(User.all.order('last_seen_at desc')[8..11]).each do |d| %>
---
SELECT "users".* FROM "users" ORDER BY last_seen_at desc

    <tbody>
      <% Discussion.all.sort_by{|d| d[:view_count]}.reverse[0..4].each do |d| %>
---
SELECT "discussions".* FROM "discussions" WHERE (created_at > '2020-04-21 23:47:37.028347') ORDER BY created_at desc