app/news/app/views/discussions/_form.html.erb

SELECT "topics".* FROM "topics" ORDER BY created_at desc
---
      <span class="select">
        <%= f.input_field :topic_id, collection:@topics.map { |c| [c.topic, c.id] }, prompt: "Select topic" %>