app/news/app/views/discussions/_sidebar.html.erb

SELECT "users".* FROM "users" ORDER BY last_seen_at desc
---
          <tr>
            <% Array(User.all.order('last_seen_at desc')[0..3]).each do |d| %>

SELECT "users".* FROM "users" ORDER BY last_seen_at desc
---
              <tr>
                <% Array(User.all.order('last_seen_at desc')[4..7]).each do |d| %>

SELECT "users".* FROM "users" ORDER BY last_seen_at desc
---
                <tr>
                  <% Array(User.all.order('last_seen_at desc')[8..11]).each do |d| %>