app/news/app/views/discussions/show.html.erb


    <h2 class="subtitle is-5 has-text-grey"><%= @discussion.replies.count %> Replies</h2>
---
SELECT "replies".* FROM "replies" WHERE "replies"."discussion_id" = ?  [["discussion_id", 1]]
SELECT COUNT(*) FROM "replies" WHERE "replies"."discussion_id" = ?  [["discussion_id", 1]]