app/news/app/views/replies/_reply.html.erb

INSERT INTO "replies" ("reply", "created_at", "updated_at", "discussion_id", "user_id") VALUES (?, ?, ?, ?, ?)  [["reply", "Adding a second comment with JS enabled"], ["created_at", "2020-05-04 04:26:23.385991"], ["updated_at", "2020-05-04 04:26:23.385991"], ["discussion_id", 1], ["user_id", 1]]
---
        <p>
          <strong><%= reply.user.username %></strong> <small><%= time_ago_in_words(reply.created_at) %></small>