app/news/app/controllers/discussions_controller.rb

  def index
    @discussions = Discussion.all.order('created_at desc')
---
SELECT "discussions".* FROM "discussions" ORDER BY created_at desc

  def show
    @discussions = Discussion.all.order('created_at desc')
    @discussion.increment
---
SELECT "discussions".* FROM "discussions" ORDER BY created_at desc
UPDATE "discussions" SET "view_count" = ?, "updated_at" = ? WHERE "discussions"."id" = ?  [["view_count", 1], ["updated_at", "2020-05-09 02:32:42.284739"], ["id", 2]]

  def create
    @discussion = current_user.discussions.build(discussion_params)

    respond_to do |format|
      if @discussion.save
---
INSERT INTO "discussions" ("title", "content", "created_at", "updated_at", "user_id", "topic_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Overwatch Games"], ["content", "Test on overwatch games"], ["created_at", "2020-05-09 02:12:13.520613"], ["updated_at", "2020-05-09 02:12:13.520613"], ["user_id", 3], ["topic_id", 3]]

  def update
    respond_to do |format|
      if @discussion.update(discussion_params)
---
UPDATE "discussions" SET "content" = ?, "updated_at" = ? WHERE "discussions"."id" = ?

  def set_discussion
    @discussion = Discussion.find(params[:id])
---
SELECT  "discussions".* FROM "discussions" WHERE "discussions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def find_topics
    @topics = Topic.all.order('created_at desc')
---
SELECT "topics".* FROM "topics" ORDER BY created_at desc