app/news/app/controllers/topics_controller.rb

  def index
    @topics = Topic.all
---
SELECT "topics".* FROM "topics"

  def create
    @topic = Topic.new(topic_params)

    respond_to do |format|
      if @topic.save
---
INSERT INTO "topics" ("topic", "created_at", "updated_at") VALUES (?, ?, ?)  [["topic", "League of Legends"], ["created_at", "2020-05-03 13:04:37.643072"], ["updated_at", "2020-05-03 13:04:37.643072"]]

  def destroy
    @topic.destroy
---
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 1]]

    def set_topic
      @topic = Topic.find(params[:id])
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]