app/news/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at", "username", "password_digest") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save