app/views/users/show.html.erb

SELECT "discussions".* FROM "discussions" WHERE "discussions"."user_id" = $1 ORDER BY created_at desc  [["user_id", 1]]
---
  <p style="font-family: bold,'Arial Black'">Recent Posts</p>
  <%@user.discussions.order('created_at desc').each do |d| %>