app/views/users/show.html.erb

SELECT "discussions".* FROM "discussions" WHERE "discussions"."user_id" = $1 ORDER BY created_at desc  [["user_id", 2]]
---
  <p style="font-family: bold,'Arial Black'">Recent Posts</p>
  <%@user.discussions.order('created_at desc').each do |user_discuss| %>

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["username", "VirA"], ["LIMIT", 1]]
---
      <%# Showing the username of the user who created the user_discuss %>
      by <%= link_to user_discuss.user.username, User.where(username: user_discuss.user.username).first %>

SELECT "discussions".* FROM "discussions" ORDER BY created_at desc
---
<!--    loops through global discussions-->
    <%Discussion.all.order('created_at desc').each do |all_discuss| %>