app/views/shared/_discussions.html.erb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["username", "Jack"], ["LIMIT", 1]]
---
              <%# Showing the username of the user who created the discussion %>
              by <%= link_to discussion.user.username, User.where(username: discussion.user.username).first %>

SELECT COUNT(*) FROM "replies" WHERE "replies"."discussion_id" = ?  [["discussion_id", 7]]
---
          <p><em><small>Views: <%= discussion.view_count %></small></em></p>
          <p><em><small>Replies: <%= discussion.replies.count %></small></em></p>