app/controllers/discussions_controller.rb

  def index
    # returns a list of discussions where the creation date is within the last 30 days
    # @discussions = Discussion.where('created_at > ?', 30.days.ago)
    if params[:toggle]
    @discussions = Discussion.order(params[:sort]).where(topic_id: params[:toggle]).order('created_at desc')
  else
    @discussions = Discussion.order(params[:sort]).
        where('created_at > ?', 30.days.ago)
---
SELECT "discussions".* FROM "discussions" WHERE (created_at > '2020-04-21 23:47:37.028347') ORDER BY created_at desc

  def show
    @discussions = Discussion.all.order('created_at desc')
    @discussion.increment
---
SELECT "discussions".* FROM "discussions" ORDER BY created_at desc
UPDATE "discussions" SET "view_count" = ?, "updated_at" = ? WHERE "discussions"."id" = ?  [["view_count", 1], ["updated_at", "2020-05-09 02:32:42.284739"], ["id", 2]]

  def create
    @discussion = current_user.discussions.build(discussion_params)

    respond_to do |format|
      if @discussion.save
---
INSERT INTO "discussions" ("title", "content", "created_at", "updated_at", "user_id", "topic_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Test"], ["content", "Test"], ["created_at", "2020-05-21 04:39:27.304762"], ["updated_at", "2020-05-21 04:39:27.304762"], ["user_id", 1], ["topic_id", 1]]

  def update
    respond_to do |format|
      if @discussion.update(discussion_params)
---
UPDATE "discussions" SET "content" = ?, "updated_at" = ? WHERE "discussions"."id" = ?

  def destroy
    @discussion.destroy
---
DELETE FROM "discussions" WHERE "discussions"."id" = $1  [["id", 1]]

  def set_discussion
    @discussion = Discussion.find(params[:id])
---
SELECT  "discussions".* FROM "discussions" WHERE "discussions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def find_topics
    @topics = Topic.all.order('created_at desc')
---
SELECT "topics".* FROM "topics" ORDER BY created_at desc