app/controllers/replies_controller.rb

INSERT INTO "replies" ("reply", "created_at", "updated_at", "discussion_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["reply", "Git good"], ["created_at", "2020-05-21 09:01:30.092191"], ["updated_at", "2020-05-21 09:01:30.092191"], ["discussion_id", 2], ["user_id", 4]]
---
	def create
		# Creates a reply within a discussion
		@reply = @discussion.replies.create(params[:reply].permit(:reply, :discussion_id))
		# Sets the reply user id to the current user
		# Show that we can show what user wrote that reply
		@reply.user_id = current_user.id

		respond_to do |format|
			if @reply.save

SELECT  "replies".* FROM "replies" WHERE "replies"."discussion_id" = ? AND "replies"."id" = ? LIMIT ?  [["discussion_id", 1], ["id", 2], ["LIMIT", 1]]
DELETE FROM "replies" WHERE "replies"."id" = ?  [["id", 2]]
---
	def destroy
		# Find a reply that matches the id
		@reply = @discussion.replies.find(params[:id])
		# Delete the matching reply
		@reply.destroy

SELECT  "discussions".* FROM "discussions" WHERE "discussions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "replies".* FROM "replies" WHERE "replies"."discussion_id" = ? AND "replies"."id" = ? LIMIT ?  [["discussion_id", 1], ["id", 1], ["LIMIT", 1]]
---
	def edit
		# Get the discussion that matches the discussion id
		# Essentially find the discussion that has the reply we want to edit
		@discussion = Discussion.find(params[:discussion_id])
		# Get the reply from the found discussion that we want to edit
		@reply = @discussion.replies.find(params[:id])

SELECT  "replies".* FROM "replies" WHERE "replies"."discussion_id" = ? AND "replies"."id" = ? LIMIT ?  [["discussion_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "replies" SET "reply" = ?, "updated_at" = ? WHERE "replies"."id" = ?  [["reply", "Leaving the first reply!  Edit applied!"], ["updated_at", "2020-05-04 04:21:09.372218"], ["id", 1]]
---
	def update
		# Find the reply
		@reply = @discussion.replies.find(params[:id])

		respond_to do |format|
			if @reply.update(reply_params)

SELECT  "discussions".* FROM "discussions" WHERE "discussions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def set_discussion
		# Get discussions that match the discussion id param
		@discussion = Discussion.find(params[:discussion_id])

SELECT  "replies".* FROM "replies" WHERE "replies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def set_reply
		# Get replies that match the reply id
		@reply = Reply.find(params[:id])