app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:session][:email].downcase)
    if user && user.authenticate(params[:session][:password])
      log_in user
      remember user
      user.update_attribute(:last_seen_at, Time.now)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "rad@test.com"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "last_seen_at" = ? WHERE "users"."id" = ?  [["updated_at", "2020-05-19 08:05:18.711553"], ["last_seen_at", "2020-05-19 08:05:18.708667"], ["id", 6]]