app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "created_at", "updated_at", "username", "password_digest", "city") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def edit
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "date_created" = $2 WHERE "users"."id" = $3  [["updated_at", "2020-05-21 08:33:48.146247"], ["date_created", "2020-05-21 00:00:00"], ["id", 4]]